cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'

# install packages
brew 'fish'
brew 'gtop'
brew 'neofetch'
brew 'tree'
brew 'wget'
brew 'graphviz'
brew 'pyenv'
brew 'gh'
brew 'mas'
brew 'openjdk'
brew 'py3cairo' # required for manim
brew 'ffmpeg' # required for manim
brew 'portaudio' # required for manim
brew 'sox' # required for manim

# install casks
cask 'spotify'
cask 'visual-studio-code'
cask 'alacritty'
cask 'miktex-console'
cask 'raycast'
cask 'logi-options-plus'
cask 'microsoft-teams'
cask 'obs'
cask 'steam'
cask 'minecraft'
cask 'julia'
cask 'messenger'
cask 'transmission'

mas 'DaVinci Resolve', id: 571213070
