tap 'homebrew/bundle'

# install packages
brew 'fish'
brew 'fisher'
brew 'btop'
brew 'neofetch'
brew 'tree'
brew 'wget'
brew 'pyenv'

# install casks
cask 'docker'
cask 'cursor'
cask 'spotify'
cask 'adguard'
cask 'chatgpt'
cask 'alacritty'
cask 'logitech-options'
cask 'visual-studio-code'

# install vscode plugins
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
