# install packages
brew 'mas'
brew 'fish'
brew 'btop'
brew 'tree'
brew 'pyenv'
brew 'fisher'
brew 'neofetch'

# install apps
cask 'cursor'
cask 'adguard'
cask 'chatgpt'
cask 'whatsapp'
cask 'alacritty'
cask 'appcleaner'

mas "Wipr", id: 1662217862
mas "SponsorBlock", id: 1573461917
