cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# install packages
brew 'mas'
brew 'fish'
brew 'cmake'
brew 'gtop'
brew 'neofetch'
brew 'tree'
brew 'wget'
brew 'node'
brew 'vim'
brew 'tmux'

# install casks
cask 'spotify'
cask 'visual-studio-code'
cask 'alacritty'
cask 'miktex-console'
cask '1password'
cask 'raycast'
cask '1password-cli'

# intall from app store
mas 'AdGuard for Safari', id: 1440147259
mas 'Dark Mode for Safari', id: 1397180934
mas '1Password for Safari', id: 1569813296
